how-to-hack-wslg-clipboard.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-03-17 Fri 08:42 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How To Hack Wslg Clipboard</title>
<meta name="description" content="This is my personal website, a place where to me to write anything I want." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/style.css" type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
 <span><h1 class="brand"><a href="/">大道至簡</a></h1><span class="slogen">咦！錢塘江上潮信來，今日方知我是我。</span></span> <!--<nav> <ul class="menu"> <li><a href="/">Home</a></li><li><a href="/rss.xml">RSS</a></li> </ul></nav>-->
</div>
<div id="content" class="content">
<header>
<h1 class="title">How To Hack Wslg Clipboard</h1>
</header><p>
After setup wslg on my windows11, I use the wsl's emacs as my primay editor, the basic workflow most time is webbrowser(Google Chrome) on windows.
Then coding on Emacs. The problem is the clipboard system not really working very well issue <a href="https://github.com/microsoft/wslg/issues/15">#15</a> github.
So I did hack solution:
</p>

<ol class="org-ol">
<li>create a command in wsl /usr/local/bin/wclip</li>
<li>inset /mnt/c/path-to-pwsh.exe -NonInteractive -NoLogo -NoProfile -Command "get-clipboard -Raw"</li>
<li>call wclip after copy something on windows</li>
</ol>

<p>
like for emacs
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">get-windows-clipboard</span> ()
  (<span style="font-weight: bold;">interactive</span>)
  (insert (s-replace <span style="font-style: italic;">""</span> <span style="font-style: italic;">""</span> (shell-command-to-string <span style="font-style: italic;">"wclip"</span>))))
</pre>
</div>

<p>
it's slower than native way that for sure, but it works every time.
</p>
</div>
<div id="postamble" class="status">
<script src="https://utteranc.es/client.js" repo="eggcaker/eggcaker.github.io" issue-term="pathname" theme="github-light" crossorigin="anonymous" async></script> <footer> <div class="generated"> &copy; 2023 <a href="/pages/about">TZ</a>, built with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2) <a href='/rss.xml'>RSS</a> | <a href="http://beian.miit.gov.cn/">冀ICP备2020025756号-1</a> </div> </footer>
</div>
</body>
</html>
